status/2021/21may21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>15 May 2021 - 21 May 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">15 May 2021 - 21 May 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbca9b49">1. Linux Audio</a>
<ul>
<li><a href="#org3340d87">1.1. Faust programming</a></li>
<li><a href="#orgce6127f">1.2. Next Steps</a>
<ul>
<li><a href="#org9ca9e50">1.2.1. Analog Synthesizer modules</a></li>
<li><a href="#org1d85b7f">1.2.2. LV2 autopatcher</a></li>
<li><a href="#org0577b22">1.2.3. OSC control surface</a></li>
<li><a href="#org410063c">1.2.4. Faust/csound</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6a9625a">2. Santa Cruz Weather Station</a>
<ul>
<li><a href="#org21211d9">2.1. Next step</a>
<ul>
<li><a href="#orgc247203">2.1.1. Check replacement sensor</a></li>
<li><a href="#orge7d5cb8">2.1.2. Clean BME680/VELM6075 boards</a></li>
<li><a href="#org5a11a5a">2.1.3. Design more robust instrument shelter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2856dc3">3. EPICS</a>
<ul>
<li><a href="#org6a4d7d0">3.1. Next steps</a>
<ul>
<li><a href="#org1455a28">3.1.1. u3scpi network port testing</a></li>
<li><a href="#org2aeb260">3.1.2. initial EPICS interface</a></li>
<li><a href="#orgf67e4e9">3.1.3. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org61f1b5e">4. Brini Tracker II</a>
<ul>
<li><a href="#orgb8c0d86">4.1. Next steps</a>
<ul>
<li><a href="#org3224ef6">4.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#org046cc42">4.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#org936d6d5">4.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgac5acde">5. wktcolor</a>
<ul>
<li><a href="#org5194ec7">5.1. Next steps</a>
<ul>
<li><a href="#org1e01dae">5.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4cbe391">6. wktplot</a>
<ul>
<li><a href="#org66a6255">6.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org88c5890">7. ca-r</a>
<ul>
<li><a href="#org4ca38a6">7.1. Seems to have survived Fedora 34 update</a></li>
<li><a href="#orgd1fd75c">7.2. Next Step</a></li>
</ul>
</li>
<li><a href="#orga52b3f6">8. AMDGPU</a>
<ul>
<li><a href="#orgace0ced">8.1. Next step</a>
<ul>
<li><a href="#org3b43fdb">8.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge631252">9. Ninja v Make</a>
<ul>
<li><a href="#orgb46b783">9.1. Next Step</a>
<ul>
<li><a href="#orgb4ec731">9.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org197b94b">10. Conical Rolling Pin</a>
<ul>
<li><a href="#org20a3165">10.1. Next Step</a></li>
</ul>
</li>
<li><a href="#org0c54fe4">11. Reading</a>
<ul>
<li><a href="#org25d964d">11.1. Click Here to Kill Everybody</a></li>
<li><a href="#orgf6d0ff2">11.2. The Science of Can and Can't</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Making Some Audio Progress
</p>

<div id="outline-container-orgbca9b49" class="outline-2">
<h2 id="orgbca9b49"><span class="section-number-2">1.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3340d87" class="outline-3">
<h3 id="org3340d87"><span class="section-number-3">1.1.</span> Faust programming</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Outlined "GAC" - "GMP Audio and Control". The idea here is to have
a library of audio and control blocks, and then generate Faust code
for a "panel" of selected blocks and an associated
interconnect. The interconnect is divided into three "types":
signal, control, and logic. This is mainly to reduce the size of
the interconnect, but, interestingly, roughly corresponds to the
patch separation used in Buchla modules. This is initially intended
as an exploratory tool, but I can foresee some utility in using this
approach for GPU audio programming, which can benefit from common
execution code controlled by data (here represented by the
interconnect). Control and audio interconnect is summing; logic
interconnect is multiplexing.
</p>

<p>
~34 blocks are designed; 15 are implemented. The "rwtable" interfaces used for
a sequencer were by far were the most challenging, as I'm not using the tables
as strictly "audio rate" blocks.
</p>
</div>
</div>

<div id="outline-container-orgce6127f" class="outline-3">
<h3 id="orgce6127f"><span class="section-number-3">1.2.</span> Next Steps</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org9ca9e50" class="outline-4">
<h4 id="org9ca9e50"><span class="section-number-4">1.2.1.</span> Analog Synthesizer modules</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Generate interconnect.
Design waveshaper.
</p>
</div>
</div>
<div id="outline-container-org1d85b7f" class="outline-4">
<h4 id="org1d85b7f"><span class="section-number-4">1.2.2.</span> LV2 autopatcher</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</div>
<div id="outline-container-org0577b22" class="outline-4">
<h4 id="org0577b22"><span class="section-number-4">1.2.3.</span> OSC control surface</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</div>
<div id="outline-container-org410063c" class="outline-4">
<h4 id="org410063c"><span class="section-number-4">1.2.4.</span> Faust/csound</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
See if a faust generated unit works.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org6a9625a" class="outline-2">
<h2 id="org6a9625a"><span class="section-number-2">2.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org21211d9" class="outline-3">
<h3 id="org21211d9"><span class="section-number-3">2.1.</span> Next step</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgc247203" class="outline-4">
<h4 id="orgc247203"><span class="section-number-4">2.1.1.</span> Check replacement sensor</h4>
</div>
<div id="outline-container-orge7d5cb8" class="outline-4">
<h4 id="orge7d5cb8"><span class="section-number-4">2.1.2.</span> Clean BME680/VELM6075 boards</h4>
</div>
<div id="outline-container-org5a11a5a" class="outline-4">
<h4 id="org5a11a5a"><span class="section-number-4">2.1.3.</span> Design more robust instrument shelter</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Use existing small mast for VEML6075; put others in larger shelter.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org2856dc3" class="outline-2">
<h2 id="org2856dc3"><span class="section-number-2">3.</span> EPICS</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org6a4d7d0" class="outline-3">
<h3 id="org6a4d7d0"><span class="section-number-3">3.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org1455a28" class="outline-4">
<h4 id="org1455a28"><span class="section-number-4">3.1.1.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-org2aeb260" class="outline-4">
<h4 id="org2aeb260"><span class="section-number-4">3.1.2.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-orgf67e4e9" class="outline-4">
<h4 id="orgf67e4e9"><span class="section-number-4">3.1.3.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>

<div id="outline-container-org61f1b5e" class="outline-2">
<h2 id="org61f1b5e"><span class="section-number-2">4.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-4">
<p>
Still working!
</p>
</div>
<div id="outline-container-orgb8c0d86" class="outline-3">
<h3 id="orgb8c0d86"><span class="section-number-3">4.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org3224ef6" class="outline-4">
<h4 id="org3224ef6"><span class="section-number-4">4.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-org046cc42" class="outline-4">
<h4 id="org046cc42"><span class="section-number-4">4.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-org936d6d5" class="outline-4">
<h4 id="org936d6d5"><span class="section-number-4">4.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-orgac5acde" class="outline-2">
<h2 id="orgac5acde"><span class="section-number-2">5.</span> wktcolor</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org5194ec7" class="outline-3">
<h3 id="org5194ec7"><span class="section-number-3">5.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org1e01dae" class="outline-4">
<h4 id="org1e01dae"><span class="section-number-4">5.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org4cbe391" class="outline-2">
<h2 id="org4cbe391"><span class="section-number-2">6.</span> wktplot</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org66a6255" class="outline-3">
<h3 id="org66a6255"><span class="section-number-3">6.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
</p>
</div>
</div>
</div>

<div id="outline-container-org88c5890" class="outline-2">
<h2 id="org88c5890"><span class="section-number-2">7.</span> ca-r</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org4ca38a6" class="outline-3">
<h3 id="org4ca38a6"><span class="section-number-3">7.1.</span> Seems to have survived Fedora 34 update</h3>
</div>
<div id="outline-container-orgd1fd75c" class="outline-3">
<h3 id="orgd1fd75c"><span class="section-number-3">7.2.</span> Next Step</h3>
<div class="outline-text-3" id="text-7-2">
<p>
None
</p>
</div>
</div>
</div>

<div id="outline-container-orga52b3f6" class="outline-2">
<h2 id="orga52b3f6"><span class="section-number-2">8.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgace0ced" class="outline-3">
<h3 id="orgace0ced"><span class="section-number-3">8.1.</span> Next step</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org3b43fdb" class="outline-4">
<h4 id="org3b43fdb"><span class="section-number-4">8.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-orge631252" class="outline-2">
<h2 id="orge631252"><span class="section-number-2">9.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgb46b783" class="outline-3">
<h3 id="orgb46b783"><span class="section-number-3">9.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-orgb4ec731" class="outline-4">
<h4 id="orgb4ec731"><span class="section-number-4">9.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-org197b94b" class="outline-2">
<h2 id="org197b94b"><span class="section-number-2">10.</span> Conical Rolling Pin</h2>
<div class="outline-text-2" id="text-10">
<p>
Conical Rolling pin worked great except the sharp point dug into the
dough.  Point isn't necessary.
</p>
</div>
<div id="outline-container-org20a3165" class="outline-3">
<h3 id="org20a3165"><span class="section-number-3">10.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Soften point.
</p>
</div>
</div>
</div>
<div id="outline-container-org0c54fe4" class="outline-2">
<h2 id="org0c54fe4"><span class="section-number-2">11.</span> Reading</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org25d964d" class="outline-3">
<h3 id="org25d964d"><span class="section-number-3">11.1.</span> Click Here to Kill Everybody</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Bruce Schneier
<a href="https://www.schneier.com/books/click-here/">https://www.schneier.com/books/click-here/</a>
We're screwed.
Signed copy was a birthday gift from Mark Houde. Thanks Mark!
</p>
</div>
</div>
<div id="outline-container-orgf6d0ff2" class="outline-3">
<h3 id="orgf6d0ff2"><span class="section-number-3">11.2.</span> The Science of Can and Can't</h3>
<div class="outline-text-3" id="text-11-2">
<p>
Chiara Marletto
<a href="https://www.barnesandnoble.com/w/the-science-of-can-and-cant-chiara-marletto/1137528552?ean=9780525521921">https://www.barnesandnoble.com/w/the-science-of-can-and-cant-chiara-marletto/1137528552?ean=9780525521921</a>
A different approach to Quantum Mechanics and Quantum Information Theory
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
